-- lazy.nvim
return {
	"folke/snacks.nvim",
	opts = {
		dashboard = {
			-- your dashboard configuration comes here
			-- or leave it empty to use the default settings
			-- refer to the configuration section below
			preset = {
				header = [[
███╗   ██╗ ███═╗███████ ███═╗███╗   ██╗
████╗  ██║█████║   █  ║█████║████╗  ██║
██╔██╗ ██║█   █║   █  ║█   █║██╔██╗ ██║
██║╚██╗██║█████║   █  ║█████║██║╚██╗██║
██║ ╚████║█   █║   █  ║█   █║██║ ╚████║
╚═╝  ╚═══╝╚════╝   ╚══╝╚════╝╚═╝  ╚═══╝
        ]],
			},
		},
		picker = {
			sources = {
				explorer = { hidden = true },
			},
			files = {
				files = { hidden = true },
			},
		},
	},
}
