#############
# common taps
#############

tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"
tap "manaflow-ai/cmux"

#############
# formulas
#############

# shell & prompt
brew "zsh"
brew "starship"
brew "tmux"

# utilities
brew "jq"
brew "ripgrep"
brew "fd"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "zoxide"
brew "resvg"
brew "imagemagick"
brew "fzf"
brew "yazi"
brew "mole"

# miscellaneous
brew "felixkratz/formulae/borders"

# programming tools & runtime & containers
brew "gh"
brew "lazygit"
brew "mise"

brew "podman"
brew "minikube"
brew "kubectl"
brew "derailed/k9s/k9s"

# mac apple store command line
brew "mas"

# text editors
brew "neovim"

# ai
brew "opencode"

# databases

# installs postgres 18 and restart service if installed or upgraded
brew "postgresql@18", restart_service: :changed

#############
# mas
#############

# nord vpn and nord pass
# mas "NordVPN - VPN for privacy", id: 905953485
# mas "NordPass® Password Manager", id: 1486322860
