#############
# common taps
#############

tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"

#############
# formulas
#############

# shell & prompt
brew "zsh"
brew "starship"

# utilities
brew "jq"
brew "ripgrep"
brew "fd"
brew "ffmpeg"
brew "sevenzip"
brew "poppler"
brew "zoxide"
brew "resvg"
brew "imagemagick"
brew "fzf"
brew "yazi"
brew "tw93/tap/mole"

# miscellaneous
brew "borders"

# programming tools / runtime
brew "gh"
brew "lazygit"
brew "mise"

# mac apple store command line
brew "mas"

# text editors
brew "neovim"

# ai
brew "opencode"

# databases

# installs postgres and restart service if installed or upgraded
brew "postgresql", restart_service: :changed

#############
# casks
#############

# networking
cask "mitmproxy"

# browsers
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "arc"

# text editors
cask "sublime-text" 
cask "visual-studio-code"

# ai
cask "claude-code"

# nerd fonts
cask "font-jetbrains-mono"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"

# terminal emulators
cask "iterm2"
cask "ghostty"

# ides
cask "xcodes-app"

# dev
cask "jupyterlab"

# aerospace tiling manager
cask "nikitabobko/tap/aerospace"

# utilities
cask "clop"

#############
# mas
#############

# nord vpn and nord pass
# mas "NordVPN - VPN for privacy", id: 905953485
# mas "NordPass® Password Manager", id: 1486322860
