#############
# common taps
#############

tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"

#############
# formulas
#############

# shell
brew "zsh"

# fuzzy finder
brew "fzf"

# prompt
brew "starship"

# utilities
brew "jq"

# github cli
brew "gh"

# lazygit
brew "lazygit"

# mac apple store command line
brew "mas"

brew "neovim"

# runtime tools management
brew "mise"

# databases

# installs postgres and restart service if installed or upgraded
brew "postgresql", restart_service: :changed

# miscellaneous

brew "borders"

#############
# casks
#############

# networking
cask "mitmproxy"

# browsers
cask "google-chrome"
cask "firefox"
cask "brave-browser"

# text editors
cask "sublime-text" 
cask "visual-studio-code"

# nerd fonts
cask "font-jetbrains-mono"
cask "font-fira-code-nerd-font"

# terminal emulators
cask "iterm2"

# ides
cask "xcodes-app"

# dev
cask "jupyterlab"

# aerospace tiling manager
cask "nikitabobko/tap/aerospace"

# utilities
cask "clop"

#############
# mas
#############

# nord vpn and nord pass
mas "NordVPN - VPN for privacy", id: 905953485
# mas "NordPass® Password Manager", id: 1486322860
